In [1]:
#Cleaning Data

In [2]:
#Data
#Item information from about 3,000 Chipotle meals from about 1,800 Grubhub orders

In [3]:
import pandas as pd
import numpy as np

In [4]:
#For many data projects, a significant proportion of time is spent collecting and cleaning the data

In [5]:
df = pd.DataFrame({"numbers": ["#23", "#24", "#18", "#14", "#12", "#10", "#35"],
                   "nums": ["23", "24", "18", "14", np.nan, "XYZ", "35"],
                   "colors": ["green", "red", "yellow", "orange", "purple", "blue", "pink"],
                   "other_column": [0, 1, 0, 2, 1, 0, 2]})
df

  numbers nums  colors  other_column
0     #23   23   green             0
1     #24   24     red             1
2     #18   18  yellow             0
3     #14   14  orange             2
4     #12  NaN  purple             1
5     #10  XYZ    blue             0
6     #35   35    pink             2

In [6]:
df["numbers"].mean()

TypeError: Could not convert string '#23#24#18#14#12#10#35' to numeric

In [7]:
#It throws an error!

In [8]:
c2n = "#39"
#Conver the string into a number

In [9]:
c2n = "#39"

numeric_value = int(c2n[1:])

print(numeric_value)
print((type(numeric_value)))

39
<class 'int'>

In [10]:
int(c2n.replace("#",""))

39

In [11]:
%%time

#loop through all elements of the column and apply the desired string methods

# Iterate over all rows
for row in df.iterrows():

    # `iterrows` method produces a tuple with two elements...
    # The first element is an index and the second is a Series with the data from that row
    index_value, column_values = row

    # Apply string method
    clean_number = int(column_values["numbers"].replace("#", ""))

    # The `at` method is very similar to the `loc` method, but it is specialized
    # for accessing single elements at a time... We wanted to use it here to give
    # the loop the best chance to beat a faster method which we show you next.
    df.at[index_value, "numbers_loop"] = clean_number

CPU times: user 2.4 ms, sys: 6.4 ms, total: 8.79 ms
Wall time: 11.7 ms

In [12]:
%%time

# ~2x faster than loop... However, speed gain increases with size of DataFrame. The
# speedup can be in the ballpark of ~100-500x faster for big DataFrames.
# See appendix at the end of the lecture for an application on a larger DataFrame
df["numbers_str"] = df["numbers"].str.replace("#", "")

CPU times: user 1.29 ms, sys: 4.35 ms, total: 5.64 ms
Wall time: 7.54 ms

In [13]:
df["colors"].str.contains("p")

0    False
1    False
2    False
3    False
4     True
5    False
6     True
Name: colors, dtype: bool

In [14]:
df["colors"].str.capitalize()

0     Green
1       Red
2    Yellow
3    Orange
4    Purple
5      Blue
6      Pink
Name: colors, dtype: object

In [17]:
#Make a new column called colors_upper that contains the elements of colors with all uppercase letters.
# Create the new column 'colors_upper' by applying .str.upper() to the 'colors' column
df["colors_upper"] = df["colors"].str.upper()
df

  numbers nums  colors  other_column  numbers_loop numbers_str colors_upper
0     #23   23   green             0          23.0          23        GREEN
1     #24   24     red             1          24.0          24          RED
2     #18   18  yellow             0          18.0          18       YELLOW
3     #14   14  orange             2          14.0          14       ORANGE
4     #12  NaN  purple             1          12.0          12       PURPLE
5     #10  XYZ    blue             0          10.0          10         BLUE
6     #35   35    pink             2          35.0          35         PINK

In [18]:
df["numbers_numeric"] = pd.to_numeric(df["numbers_str"])

In [19]:
df.dtypes

numbers             object
nums                object
colors              object
other_column         int64
numbers_loop       float64
numbers_str         object
colors_upper        object
numbers_numeric      int64
dtype: object

In [20]:
df.head()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric
0,#23,23,green,0,23.0,23,GREEN,23
1,#24,24,red,1,24.0,24,RED,24
2,#18,18,yellow,0,18.0,18,YELLOW,18
3,#14,14,orange,2,14.0,14,ORANGE,14
4,#12,NaN,purple,1,12.0,12,PURPLE,12

In [23]:
df["numbers_numeric"].astype(str)

0    23
1    24
2    18
3    14
4    12
5    10
6    35
Name: numbers_numeric, dtype: object

In [24]:
df["numbers_numeric"].astype(float)

0    23.0
1    24.0
2    18.0
3    14.0
4    12.0
5    10.0
6    35.0
Name: numbers_numeric, dtype: float64

In [28]:
# Convert to numeric, forcing errors into NaN
df["nums_tonumeric"] = pd.to_numeric(df["nums"], errors='coerce')

df

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,#23,23,green,0,23.0,23,GREEN,23,23.0
1,#24,24,red,1,24.0,24,RED,24,24.0
2,#18,18,yellow,0,18.0,18,YELLOW,18,18.0
3,#14,14,orange,2,14.0,14,ORANGE,14,14.0
4,#12,NaN,purple,1,12.0,12,PURPLE,12,NaN
5,#10,XYZ,blue,0,10.0,10,BLUE,10,NaN
6,#35,35,pink,2,35.0,35,PINK,35,35.0

In [29]:
df

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,#23,23,green,0,23.0,23,GREEN,23,23.0
1,#24,24,red,1,24.0,24,RED,24,24.0
2,#18,18,yellow,0,18.0,18,YELLOW,18,18.0
3,#14,14,orange,2,14.0,14,ORANGE,14,14.0
4,#12,NaN,purple,1,12.0,12,PURPLE,12,NaN
5,#10,XYZ,blue,0,10.0,10,BLUE,10,NaN
6,#35,35,pink,2,35.0,35,PINK,35,35.0

In [30]:
df.isnull()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,True,False,False,False,False,False,False,True
5,False,False,False,False,False,False,False,False,True
6,False,False,False,False,False,False,False,False,False

In [31]:
df.isnull().any(axis=0)
#It looks vertically (top to bottom) through each column. If it finds even one True (missing value) in a column, it returns True for that column name.

numbers            False
nums                True
colors             False
other_column       False
numbers_loop       False
numbers_str        False
colors_upper       False
numbers_numeric    False
nums_tonumeric      True
dtype: bool

In [32]:
df.isnull().any(axis=1)
#It looks horizontally (left to right) across each row. If a row has a missing value in any of its columns, that row is marked True.

0    False
1    False
2    False
3    False
4     True
5     True
6    False
dtype: bool

In [33]:
# drop all rows containing a missing observation
df.dropna()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,#23,23,green,0,23.0,23,GREEN,23,23.0
1,#24,24,red,1,24.0,24,RED,24,24.0
2,#18,18,yellow,0,18.0,18,YELLOW,18,18.0
3,#14,14,orange,2,14.0,14,ORANGE,14,14.0
6,#35,35,pink,2,35.0,35,PINK,35,35.0

In [34]:
# fill the missing values with a specific value
df.fillna(value=100)

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,#23,23,green,0,23.0,23,GREEN,23,23.0
1,#24,24,red,1,24.0,24,RED,24,24.0
2,#18,18,yellow,0,18.0,18,YELLOW,18,18.0
3,#14,14,orange,2,14.0,14,ORANGE,14,14.0
4,#12,100,purple,1,12.0,12,PURPLE,12,100.0
5,#10,XYZ,blue,0,10.0,10,BLUE,10,100.0
6,#35,35,pink,2,35.0,35,PINK,35,35.0

In [35]:
# use the _next_ valid observation to fill the missing data
df.bfill() # in new versions of pandas, bfill will directly fill missing data

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,#23,23,green,0,23.0,23,GREEN,23,23.0
1,#24,24,red,1,24.0,24,RED,24,24.0
2,#18,18,yellow,0,18.0,18,YELLOW,18,18.0
3,#14,14,orange,2,14.0,14,ORANGE,14,14.0
4,#12,XYZ,purple,1,12.0,12,PURPLE,12,35.0
5,#10,XYZ,blue,0,10.0,10,BLUE,10,35.0
6,#35,35,pink,2,35.0,35,PINK,35,35.0

In [36]:
# use the _previous_ valid observation to fill missing data
df.ffill()

,numbers,nums,colors,other_column,numbers_loop,numbers_str,colors_upper,numbers_numeric,nums_tonumeric
0,#23,23,green,0,23.0,23,GREEN,23,23.0
1,#24,24,red,1,24.0,24,RED,24,24.0
2,#18,18,yellow,0,18.0,18,YELLOW,18,18.0
3,#14,14,orange,2,14.0,14,ORANGE,14,14.0
4,#12,14,purple,1,12.0,12,PURPLE,12,14.0
5,#10,XYZ,blue,0,10.0,10,BLUE,10,14.0
6,#35,35,pink,2,35.0,35,PINK,35,35.0

In [45]:
test = pd.DataFrame({"floats": np.round(100*np.random.rand(100000),2)})
test["strings"] = test["floats"].astype(str) +"%"
test.head()

   floats strings
0   48.13  48.13%
1    8.26   8.26%
2   29.15  29.15%
3   55.87  55.87%
4   71.78  71.78%

In [46]:
%%time

for row in test.iterrows():
    index_value, column_values = row
    clean_number = column_values["strings"].replace("%", "")
    test.at[index_value, "numbers_loop"] = clean_number

CPU times: user 2.54 s, sys: 35.3 ms, total: 2.58 s
Wall time: 2.59 s

In [47]:
%%time
test["numbers_str_method"] = test["strings"].str.replace("%", "")

CPU times: user 17.7 ms, sys: 9.61 ms, total: 27.3 ms
Wall time: 31.6 ms

In [48]:
test["numbers_str_method"].equals(test["numbers_loop"])

True